$(function () { /////// jQB ///////////////////////

    console.log("로딩완료!");

    /// 전역변수 ///////
    var setPers = 90;
    var setTime = 3000;


    $(function () { // jQB /////////////////

        // svg 애니메이션 셋팅
        var newPers = 300 * ((100 - setPers) / 100);
        // 300은 원래 전체 %수
        // 이것의 70%라면 나머지 30%가 빠진 숫치로 넣으면됨!
        //console.log("계산:"+newPers);
        $(".c1").delay(1000).animate({
            strokeDashoffset: newPers + "%"
        }, setTime); //// animate //////

        // 1초후 퍼센트증가 함수 호출하기!
        setTimeout(function () {
            addPers(setPers, setTime);
        }, 1000); /// 타임아웃 ////

    }); ///////// jQB /////////////////////
    /////////////////////////////////////

    
    /*/////////////////////////////////////////////
        함수명:addPers
        기능: 파라미터로 넘어온 수치까지 퍼센트를 증가시킴
    */ /////////////////////////////////////////////
    var pers = 0; // 퍼센트숫자 초기값
    function addPers(limit, duration) {
        // limit - 퍼센트한계값, duration - 전체시간(1/1000)
        pers++; //1씩증가
        // 화면 퍼센트 출력하기
        $(".num").text(pers);

        // 자기자신을 호출함(재귀호출!)
        if (pers < limit) { // limit 한계 퍼센트까지만 재귀호출
            setTimeout(function () {
                addPers(limit, duration);
            }, duration / limit); /// 타임아웃 ////
            // 타임아웃시간을 전체시간/한계퍼센트로 등분함!
        } /// if /////////////////

    } ///////////// addPers 함수 ////////////////////
    ////////////////////////////////////////////////
    ////////////////////////////////////////////////
    
    
    
    
    
    
    

}); ////////// jQB ///////////////////////////////

/////////////////////////////////////////////////
